# Symbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextElement..::..Symbol Property
TextElement Class See Also
---
Get the type of the TextElement object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TextElementType Symbol { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Symbol As TextElementType
	Get
```

Visual C++
---
```text
public:
property TextElementType^ Symbol {
	TextElementType^ get ();
}
```

# Remarks
The user can call this property to get the related type.
# See Also
TextElement Class
Autodesk.Revit.DB Namespace